[
    {
        "frame_name": "argue.01",
        "tweet_id": "1457055229468348420",
        "text": "litupmagazine thomaschattwill nhannahjones well argument made people coming different background affect also mostly explain inequality better race poor people tend worse middle class rich people ethnicity tends poorer others",
        "date": "2021-11-06T18:40:12.000Z",
        "subjectivity": "0.5071428571428572",
        "polarity": "0.08214285714285714",
        "analysis": "Positive",
        "frame_roles": {
            "V": [
                "argument"
            ]
        },
        "topics": [
            "inequality",
            "people",
            "amp",
            "woman",
            "u",
            "get",
            "like",
            "poverty",
            "gender",
            "fight"
        ],
        "results": {
            "head": {
                "link": [],
                "vars": [
                    "frame",
                    "comment"
                ]
            },
            "results": {
                "distinct": false,
                "ordered": true,
                "bindings": [
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Reasoning"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "An Arguer presents a Content, along with Support, to an Addressee. The Content may refer elliptically to a course of action or it may refer to a proposition that the Addressee is to believe. Some lexical units (e.g. \"prove\") indicate the speaker's belief about the Content.Jan argued that the evidence was inadmissable.Jan argued against the admissability of the evidence.Jan proved that the evidence was inadmissable."
                        }
                    }
                ]
            }
        }
    },
    {
        "frame_name": "make.02",
        "tweet_id": "1457055229468348420",
        "text": "litupmagazine thomaschattwill nhannahjones well argument made people coming different background affect also mostly explain inequality better race poor people tend worse middle class rich people ethnicity tends poorer others",
        "date": "2021-11-06T18:40:12.000Z",
        "subjectivity": "0.5071428571428572",
        "polarity": "0.08214285714285714",
        "analysis": "Positive",
        "frame_roles": {
            "V": [
                "made"
            ],
            "arg0": [
                "litupmagazine thomaschattwill nhannahjones well argument"
            ],
            "arg1": [
                "people coming different background affect also mostly explain inequality better race"
            ]
        },
        "topics": [
            "inequality",
            "people",
            "amp",
            "woman",
            "u",
            "get",
            "like",
            "poverty",
            "gender",
            "fight"
        ],
        "results": {
            "head": {
                "link": [],
                "vars": [
                    "frame",
                    "comment"
                ]
            },
            "results": {
                "distinct": false,
                "ordered": true,
                "bindings": [
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Causation"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "A Cause causes an Effect. Alternatively, an Actor, a participant of a (implicit) Cause, may stand in for the Cause. The entity Affected by the Causation may stand in for the overall Effect situation or event. Those frames that inherit the Causation frame have as their background the idea that some event is responsible for the occurrence of another event (or state). In the inheriting frame, typically an FE like Agent or Causer is proposed in the place of the Actor, but in the daughter frames, as in this frame, the Actor is semantically dependent on the idea of a Cause (an event or state-of-affairs) that the Actor is a participant in. Similarly, most inheriting frames profile only the Affected entity, not the full Effect situation which is often incorporated into the frame or the particular target. So, for example, paint.v in the Filling frame entails the final situation of something (the Affected) being covered in paint (the Effect). He made me angry. If such a small earthquake causes problems, just imagine a big one! The strange mutations of the rumor mill in the end led to it being said that he was actually a woman. You 've made it impossible to continue! The ending left me feeling kinda empty."
                        }
                    },
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Cause_change"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "An Agent or Cause causes an Entity to change, either in its category membership or in terms of the value of an Attribute. In the former case, an Initial_category and a Final_category may be expressed, in the latter case an Initial_value and a Final_value can be specified. Our storylines follows the saga outlined by the Ultima Series, but we have modified it in order to make our writing more cohesive. I don't think you can turn that rabbit into a hat. How can a guy that changed his name from Bob Craft to Jack Ass declare anyone defamed his character? At this juncture, a new development changed the political situation on the island. She had at some time earlier completely changed her clothing and appearance and now stood in front of me dressed like a garden gnome. Hence, when (Hg 0 ) is converted to Hg 2+ , it can be rapidly taken up in rain water, snow, or adsorbed onto small particles Hence, when (Hg 0 ) is converted to Hg 2+ , it can be rapidly taken up in rain water, snow, or adsorbed onto small particles"
                        }
                    }
                ]
            }
        }
    },
    {
        "frame_name": "come.01",
        "tweet_id": "1457055229468348420",
        "text": "litupmagazine thomaschattwill nhannahjones well argument made people coming different background affect also mostly explain inequality better race poor people tend worse middle class rich people ethnicity tends poorer others",
        "date": "2021-11-06T18:40:12.000Z",
        "subjectivity": "0.5071428571428572",
        "polarity": "0.08214285714285714",
        "analysis": "Positive",
        "frame_roles": {
            "V": [
                "coming"
            ],
            "arg1": [
                "different background affect"
            ]
        },
        "topics": [
            "inequality",
            "people",
            "amp",
            "woman",
            "u",
            "get",
            "like",
            "poverty",
            "gender",
            "fight"
        ],
        "results": {
            "head": {
                "link": [],
                "vars": [
                    "frame",
                    "comment"
                ]
            },
            "results": {
                "distinct": false,
                "ordered": true,
                "bindings": [
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Arriving"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "An object Theme moves in the direction of a Goal. The Goal may be expressed or it may be understood from context, but its is always implied by the verb itself. Some students arrived at the school on Sunday. It was his arrival at Nijmegen in 837 that made the Vikings withdraw."
                        }
                    },
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Becoming"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "An Entity ends up with some Final_quality--a new fact about the Entity. Alternatively, based on a cluster of changes of characteristics, the Entitynewly meets the conditions for being a member of a Final_category. The weather turned cold . You can become a firefighter today ! This frame should be compared with the Transition_to_state frame, which is more general in allowing arbitrary descriptions of a final situation: We ended up telling him to leave . There is no way to effectively paraphrase such a sentence in the Becoming frame."
                        }
                    },
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Getting"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "A Recipient starts off without the Theme in their possession, and then comes to possess it. Although the Source from which the Theme came is logically necessary, the Recipient and its changing relationship to the Theme is profiled. I got two whistles from John."
                        }
                    },
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Motion"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "Some entity (Theme) starts out in one place (Source) and ends up in some other place (Goal), having covered some space between the two (Path). Alternatively, the Area or Directionin which the Theme moves or the Distance of the movement may be mentioned. That kite you see just to the right of his head was moving around pretty fast but the camera seemed to catch it ok. There are several accounts of the stench drifting to shore from the ships in the middle of the river Dust particles floating about made him sneeze uncontrollably. The grill, unsecured, rolled a few feet across the yard. The swarm went away to the end of the hall. The frames that inherit the general Motion frame add some elaboration to this simple idea. Inheriting frames can add Goal-profiling (arrive, reach), Source-profiling (leave, depart), or Path-profiling (traverse, cross), or aspects of the manner of motion (run, jog) or assumptions about the shape-properties, etc., of any of the places involved (insert, extract). A particularly complex area in the vocabulary of Motion is the depiction of the relation of Vehicles to the Theme. In some cases, no separate Theme is expressed: The plane flew over the city. In this case, the sentence is annotated in Self_motion. When the Vehicle is profiled as being operated by a Driver, the sentence is annotated in the Operate_vehicles frame: Don't try to fly an F-16 without training! This is very similar to the Bringing frame which covers cases where the Vehicle is necessarily involved, but the movement of the Theme (something carried by the Vehicle) is profiled: It's scary flying hundreds of people over thousands of miles of ocean every day. Some of the same vocabulary is also used to describe the situation where Passengers Ride_vehicle or Operate_vehicle (each of these a perspective on Use_vehicles): I flew to Chicago on the red-eye. I flew my plane across the Canadian border Finally, there are cases where, despite the use of similar vocabulary, there is no self-propelled Vehicle involved at all: The ball flew over the fence. This last type is annotated in the simple Motion frame."
                        }
                    },
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Reveal_secret"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "A Speaker reveals Information that was previously secret to an Addressee. In some cases, the Addressee is expected to keep the Information from other parties. The Information may be damaging to the reputation of the Speaker. Instead of (or in addition to) a Speaker, a Medium may also be mentioned. Likewise, a Topic may be stated instead of Information. Some lexical units in this frame imply that the Addressee has already been confronted with the Information. Could it be true that Martin himself was the one who spilled the beans on Pops and Brad's planned wedding?"
                        }
                    },
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Travel"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "In this frame a Traveler goes on a journey, an activity, generally planned in advance, in which the Traveler moves from a Source location to a Goal along a Path or within an Area. The journey can be accompanied by Co-participants and Baggage. The Duration or Distance of the journey, both generally long, may also be described as may be the Mode_of_transportation. Words in this frame emphasize the whole process of getting from one place to another, rather than profiling merely the beginning or the end of the journey. Ellen journeyed to Europe with five suitcases. Samantha journeyed 2500 miles with her family by sea to China.The Osbournes took a trip from Beverly Hills to London on the Concorde."
                        }
                    }
                ]
            }
        }
    },
    {
        "frame_name": "affect.01",
        "tweet_id": "1457055229468348420",
        "text": "litupmagazine thomaschattwill nhannahjones well argument made people coming different background affect also mostly explain inequality better race poor people tend worse middle class rich people ethnicity tends poorer others",
        "date": "2021-11-06T18:40:12.000Z",
        "subjectivity": "0.5071428571428572",
        "polarity": "0.08214285714285714",
        "analysis": "Positive",
        "frame_roles": {
            "V": [
                "affect"
            ],
            "arg1": [
                "background"
            ],
            "argmMnr": [
                "different"
            ]
        },
        "topics": [
            "inequality",
            "people",
            "amp",
            "woman",
            "u",
            "get",
            "like",
            "poverty",
            "gender",
            "fight"
        ],
        "results": {
            "head": {
                "link": [],
                "vars": [
                    "frame",
                    "comment"
                ]
            },
            "results": {
                "distinct": false,
                "ordered": true,
                "bindings": [
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Objective_influence"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "An Influencing_entity, an Influencing_situation, or an Influencing_variable has an influence on a Dependent_entity, Dependent_situation, or a Dependent_variable. Compare to Subjective_influence. Words in Objective_influence are used to make claims about correlations in the world, where words in Subjective_influence are used to explain emotional impacts made on cognizers. More and more doctors realise that diet can influence disease. Our subject is the body clock; how it influences our physiology and behaviour and how it interacts with the rhythms in our environment. But it is more likely that a physical restraint influenced the swirling liquids. It claimed, perhaps hollowly, that NT had yet to impact its business. This kind of elementary boo-boo would certainly impact video speed."
                        }
                    }
                ]
            }
        }
    },
    {
        "frame_name": "explain.01",
        "tweet_id": "1457055229468348420",
        "text": "litupmagazine thomaschattwill nhannahjones well argument made people coming different background affect also mostly explain inequality better race poor people tend worse middle class rich people ethnicity tends poorer others",
        "date": "2021-11-06T18:40:12.000Z",
        "subjectivity": "0.5071428571428572",
        "polarity": "0.08214285714285714",
        "analysis": "Positive",
        "frame_roles": {
            "V": [
                "explain"
            ],
            "arg1": [
                "inequality better race"
            ],
            "arg0": [
                "people coming different background affect"
            ],
            "argmDis": [
                "also"
            ],
            "argmAdv": [
                "mostly"
            ]
        },
        "topics": [
            "inequality",
            "people",
            "amp",
            "woman",
            "u",
            "get",
            "like",
            "poverty",
            "gender",
            "fight"
        ],
        "results": {
            "head": {
                "link": [],
                "vars": [
                    "frame",
                    "comment"
                ]
            },
            "results": {
                "distinct": false,
                "ordered": true,
                "bindings": [
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Explaining_the_facts"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "A Question about the reason or cause of a known State_of_affairs is presented as being answered by the existence of a particular Fact. The exact chain of reasoning, including the answer itself, of which the Fact is a part is not specified. Contrast this frame with the Evidence frame which casts a Support (a fact) as providing Evidence for, or conclusively proving, the Proposition (another proposed fact). Thus, there is no open question in the Evidence frame. Ruby's orange vest marked with the words \"service dog\" accounts for why the 3-year-old goes along. The nation's history explains why the current conflict succumbs to, and yet simultaneously transcends, the stereotype. Then that I exist is explained by A and B having come together. Lack of potential for improvement in the immediate future accounts for the low number of returnees into South Ossetia, even for the Ossetian ethnic group. That explains it. Somehow this explains why Apple is always the last man to get the technology."
                        }
                    },
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Justifying"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "An Agent has done or omitted to do an Act or is responsible for the obtaining of a State_of_affairs, which a Judge deems to constitute a violation of an obligation or a moral guideline. The Agent gives a Reason why the Act or omission or State_of_affairs was licit despite appearances. NOTE: There is a consistent metaphorical conception of justifying as defending. Words in the defending frame can also be used in the justifying frame. Kim failed to fully justify his decision."
                        }
                    },
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Statement"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "This frame contains verbs and nouns that communicate the act of a Speaker to address a Message to some Addressee using language. Instead of (or in addition to) a Speaker, a Medium may also be mentioned. Likewise, a Topic may be stated instead of a Message. A number of the words can be used performatively, such as declare and insist. I now declare you members of this Society. She said that I would be late . The announcement about raffle winners came across the loudspeaker."
                        }
                    }
                ]
            }
        }
    },
    {
        "frame_name": "race.02",
        "tweet_id": "1457055229468348420",
        "text": "litupmagazine thomaschattwill nhannahjones well argument made people coming different background affect also mostly explain inequality better race poor people tend worse middle class rich people ethnicity tends poorer others",
        "date": "2021-11-06T18:40:12.000Z",
        "subjectivity": "0.5071428571428572",
        "polarity": "0.08214285714285714",
        "analysis": "Positive",
        "frame_roles": {
            "V": [
                "race"
            ],
            "argmAdv": [
                "also"
            ]
        },
        "topics": [
            "inequality",
            "people",
            "amp",
            "woman",
            "u",
            "get",
            "like",
            "poverty",
            "gender",
            "fight"
        ],
        "results": {
            "head": {
                "link": [],
                "vars": [
                    "frame",
                    "comment"
                ]
            },
            "results": {
                "distinct": false,
                "ordered": true,
                "bindings": [
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Retaining"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "In this frame an Agent continues to possess a Theme for a Duration of time. In her heart she must retain bitterness against those who had killed him. I kept the iPhone Sally gave me."
                        }
                    }
                ]
            }
        }
    },
    {
        "frame_name": "love.01",
        "tweet_id": "1457055203388280833",
        "text": "nothing libs love talking institutional problem parliament one set sort investigative committee set proposal great way actually address economic inequality faced black community",
        "date": "2021-11-06T18:40:05.000Z",
        "subjectivity": "0.4166666666666667",
        "polarity": "0.26666666666666666",
        "analysis": "Positive",
        "frame_roles": {
            "V": [
                "love"
            ],
            "arg0": [
                "nothing libs"
            ],
            "arg1": [
                "talking institutional problem parliament"
            ]
        },
        "topics": [
            "inequality",
            "amp",
            "worker",
            "job",
            "low",
            "review",
            "japan",
            "apartheid",
            "black",
            "help"
        ],
        "results": {
            "head": {
                "link": [],
                "vars": [
                    "frame",
                    "comment"
                ]
            },
            "results": {
                "distinct": false,
                "ordered": true,
                "bindings": [
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Experiencer_focus"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "The words in this frame describe an Experiencer's emotions with respect to some Content. A Reason for the emotion may also be expressed. Although the Content may refer to an actual, current state of affairs, quite often it refers to a general situation which causes the emotion. My enjoyment of the movie was considerably impaired by the seven-foot guy sitting in front of me. Smithers takes great pleasure in collecting matchboxes. Sergio derives great pleasure from smoking. Smoking gives me extreme pleasure. With certain verbs, the Circumstances can be expressed in a finite clausal or wh- complement which may optionally be preceded by a Null NP Object: I hate it when you do that. Note: This is not how it is currently tagged."
                        }
                    },
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Personal_relationship"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "The words in this frame have to do with people and the personal Relationships they are or can be a part of. Some of the words denote people engaged in a particular kind of Relationship, others denote the Relationship, yet others the events bringing about or ending the Relationships. Many of the words presuppose an understanding of states and events that must have occurred before another event takes place or before a person can be classified in a certain way. And of course that drippy boyfriend of hers backed her up. As the happy couple took their places there was a stir and a rising babble behind them. Pattie is living proof that if you live with a man, you discover a lot you didn't know when you were just dating him."
                        }
                    }
                ]
            }
        }
    },
    {
        "frame_name": "talk.01",
        "tweet_id": "1457055203388280833",
        "text": "nothing libs love talking institutional problem parliament one set sort investigative committee set proposal great way actually address economic inequality faced black community",
        "date": "2021-11-06T18:40:05.000Z",
        "subjectivity": "0.4166666666666667",
        "polarity": "0.26666666666666666",
        "analysis": "Positive",
        "frame_roles": {
            "V": [
                "talking"
            ],
            "arg0": [
                "nothing libs"
            ],
            "arg1": [
                "institutional problem parliament"
            ]
        },
        "topics": [
            "inequality",
            "amp",
            "worker",
            "job",
            "low",
            "review",
            "japan",
            "apartheid",
            "black",
            "help"
        ],
        "results": {
            "head": {
                "link": [],
                "vars": [
                    "frame",
                    "comment"
                ]
            },
            "results": {
                "distinct": false,
                "ordered": true,
                "bindings": [
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Chatting"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "A group of people (the Interlocutors or Interlocutor_1 and Interlocutor_2 together) have a conversation. No person is construed as only a speaker or only an addressee. Rather, it is understood that both (or all) participants do some speaking and some listening--the process is understood to be symmetrical or reciprocal. In this frame, the purpose of the conversation is generally social, rather than specifically to decide something or exchange information, or to quarrel (see Discussion and Quarreling). If you ain't got nothin' better to do, I 'd like to shoot the breeze with you for a couple. We used to chat about everything."
                        }
                    },
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Statement"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "This frame contains verbs and nouns that communicate the act of a Speaker to address a Message to some Addressee using language. Instead of (or in addition to) a Speaker, a Medium may also be mentioned. Likewise, a Topic may be stated instead of a Message. A number of the words can be used performatively, such as declare and insist. I now declare you members of this Society. She said that I would be late . The announcement about raffle winners came across the loudspeaker."
                        }
                    }
                ]
            }
        }
    },
    {
        "frame_name": "base.02",
        "tweet_id": "1457054652197920770",
        "text": "equity based education handled equity alliance minnesota know anything heard change anyone point focus changed equity outcome guaranteed inequity inequality notice explanation",
        "date": "2021-11-06T18:37:54.000Z",
        "subjectivity": "0.0",
        "polarity": "0.0",
        "analysis": "Neutral",
        "frame_roles": {
            "V": [
                "based"
            ],
            "arg2": [
                "equity"
            ],
            "arg1": [
                "education"
            ]
        },
        "topics": [
            "inequality",
            "people",
            "amp",
            "woman",
            "u",
            "get",
            "like",
            "poverty",
            "gender",
            "fight"
        ],
        "results": {
            "head": {
                "link": [],
                "vars": [
                    "frame",
                    "comment"
                ]
            },
            "results": {
                "distinct": false,
                "ordered": true,
                "bindings": []
            }
        }
    },
    {
        "frame_name": "educate.01",
        "tweet_id": "1457054652197920770",
        "text": "equity based education handled equity alliance minnesota know anything heard change anyone point focus changed equity outcome guaranteed inequity inequality notice explanation",
        "date": "2021-11-06T18:37:54.000Z",
        "subjectivity": "0.0",
        "polarity": "0.0",
        "analysis": "Neutral",
        "frame_roles": {
            "V": [
                "education"
            ],
            "arg2": [
                "equity based"
            ]
        },
        "topics": [
            "inequality",
            "people",
            "amp",
            "woman",
            "u",
            "get",
            "like",
            "poverty",
            "gender",
            "fight"
        ],
        "results": {
            "head": {
                "link": [],
                "vars": [
                    "frame",
                    "comment"
                ]
            },
            "results": {
                "distinct": false,
                "ordered": true,
                "bindings": [
                    {
                        "frame": {
                            "type": "uri",
                            "value": "https://w3id.org/framester/framenet/abox/frame/Education_teaching"
                        },
                        "comment": {
                            "type": "literal",
                            "xml:lang": "en",
                            "value": "This frame contains words referring to teaching and the participants in teaching. A Student comes to learn either about a Subject; a Skill; a Precept; or a Fact as a result of instruction by a Teacher. Some of the nouns (schoolmaster, -mistress) in this frame refer to administrative positions and do not take relevant frame elements; these will be moved. Dad taught me that if you work hard, you will be OK - no matter what happens. What Our Cat taught Me About Marketing! For two years she taught me French Mom and Dad taught me not to bullshit, because it always came back to bite me in the ass, without fail. A young swiss girl up in a swiss chalet taught me how to yodel. Young Murdock later met a blind martial arts master known as Stick, who taught him how to use his augmented senses and trained him as a fighter. Maria, a woman studying to be a nun is sent from her convent to be the governess of the seven children of a widowed naval captain Frame-Element relations: Several Frame element relations hold in this frame. There is a core-set {Material, Teacher} (possibly also including Institution); these FE's can fill the subject slot of the teach-type verbs. There is another core-set {Precept, Subject, Skill, Fact, Role} to do with what is learnt. In addition, the FE Qualification may occur with Subject and Role My sister is studying for a maths degree to be a teacher She's studying maths to be a teacher . Phrases expressing Qualification also very often include information about the Subject (see below), which is to be annotated on the second layer. Bill is studying for a BS in physics/a maths degree. Bill is studying for a BS in physics/a maths degree."
                        }
                    }
                ]
            }
        }
    }
]